In [1]:
# Import the pandas library. We use 'pd' as a shortcut.
import pandas as pd

# Read the CSV file you downloaded
df = pd.read_csv(r'C:\Users\khadi\Datasets\titanic_large.csv')

# Show the first 10 rows
df.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,75722,0,3,"Robinson, Master. Steven",male,55.6,2,3,600542,3.02,Q
1,80185,1,2,"Wilson, Master. Richard",male,85.0,1,0,561216,8.68,S
2,19865,1,2,"Taylor, Ms. Betty",female,NaN,0,0,589751,4.61,S
3,76700,1,3,"Smith, Mrs. Elizabeth",female,13.3,0,0,96366,5.56,S
4,92992,0,1,"Jackson, Rev. Daniel",male,55.9,0,1,416388,40.64,S
5,76435,1,3,"Garcia, Dr. Patricia",female,66.9,1,0,666984,12.73,S
6,84005,1,2,"Anderson, Mrs. Sarah",female,NaN,1,1,549707,12.21,S
7,80918,0,3,"Jones, Miss. Kimberly",female,20.4,3,0,189358,0.00,S
8,60768,0,1,"Jackson, Rev. Joseph",male,9.4,0,1,863581,64.33,S
9,50075,1,1,"Jackson, Master. John",male,NaN,0,0,676219,137.30,S